clc,clear all
x=[0,1];y=[1,1];plot(x,y,‘blue’)%常函数的分段是不一样的。横线
hold on;%表示多个图线画在同一张图上
x=[1,1];y=[1,4];plot(x,y,‘blue’)%（1,1）和（1,4）两点连线， 竖线
hold on;
x=[1,2];y=[4,4];plot(x,y,‘blue’)%（1,4）和（2,4）两点连线
hold on;
x=[2,2];y=[2,4];plot(x,y,‘blue’)%同理
hold on;
x=[2,3];y=[2,2];plot(x,y,‘blue’)
hold on;
x=[3,3];y=[1.5,2];plot(x,y,‘blue–’)%–代表虚线
set(gca,‘xtick’,[0:0.5:5])%令x轴0到5步长为0.5显示各个刻度
set(gca,‘xticklabel’,{‘0’,’’,‘1’,’’,‘2’,’’,‘3’,’’,‘4’,’’,‘5’})%这里点的个数
%要与前面[0:0.5:5]的个数对应起来，否则会循环表示
%不想表示出来的数字可以用‘’就是什么也没有。
set(gca,‘yticklabel’,{‘0’,’’,‘1’,’’,‘2’,’’,‘3’,’’,‘4’,’’,‘5’})
hold on;
axis([0,5,0,5])